In [40]:
import numpy as np
import pandas as pd

data_2007=pd.read_csv('2007_1.csv')
df1=pd.DataFrame(data_2007)
df1.head()

,Parcel ID,Location,Owner,Built,Total Value,Beds,Lot size,LUC,NHood,Sale date,Book Page
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,045B-000-002-085,18 ABINGTON AVENUE,HARKINS JAMES P LIFE ESTATE,1931,"$214,800",2.0,"5,001",101,202,5/23/07,C110554
2,NaN,NaN,HARKINS PATRICIA A LIFE ESTATE,Cape,NaN,1.0,936,ONE FAM,NaN,NaN,NaN
3,NaN,NaN,HARKINS PAUL E,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,048-000-039-012,1 ACACIA RD,MORLEY-NORTON DENISE,1975,"$258,700",3.0,"8,276",101,204,5/29/07,34586-319

In [41]:
df1 = df1[pd.notnull(df1['Lot size'])]
df1.head()

df1 = df1.reset_index(drop=True)

In [42]:
df1['Beds']=pd.to_numeric(df1['Beds'])
df1['Bath'] = df1['Beds'].iloc[1::2]
df1['Bath'] = df1['Bath'].shift(periods=-1)

In [8]:
df1['Bed/Bath'] = df1['Beds'] + df1['Bath']

In [9]:
x = pd.isnull(df1['Sale date'])

for index, row in df1.iterrows():
    if(x[index+1] == True):
        df1 = df1.drop(index)
        df1 = df1.drop(index+1)

In [46]:
df1['Price'] = df1['Sale date'].loc[1::2]
df1['Price'] = df1['Sale date'].shift(periods=-1)

In [48]:
df1 = df1[pd.notnull(df1['Location'])]

In [49]:
df1 = df1.reset_index(drop=True)
df1['Location'] = df1['Location'].astype(str)

In [51]:
df1.to_excel("output2007.xlsx", index=False, header=True)